hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
               set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
            if (read_flag(&successfully_received_flags_g, CONNECT_TO_SERVER_FLAG)) {
               on_successfully_receive_general_actions(CONNECT_TO_SERVER_FLAG);
            }
            if (read_flag(&successfully_received_flags_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
               on_successfully_receive_general_actions(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
            }
            if (read_flag(&successfully_received_flags_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
               on_successfully_receive_general_actions(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

               if (on_response_g != NULL) {
                  on_response_g();
                  on_response_g = NULL;
               }
            }
            if (read_flag(&successfully_received_flags_g, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);

               if (!is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_STATION_MODE)) {
                  add_piped_task_to_send_into_head(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
               }
            }
            if (read_flag(&successfully_received_flags_g, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
            }
            if (read_flag(&successfully_received_flags_g, GET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(GET_OWN_IP_ADDRESS_FLAG);

               unsigned char some_another_ip = !is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS);
               if (some_another_ip) {
                  add_piped_task_to_send_into_head(SET_OWN_IP_ADDRESS_FLAG);
               }
            }
            if (read_flag(&successfully_received_flags_g, SET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(SET_OWN_IP_ADDRESS_FLAG);
            }
            if (read_flag(&successfully_received_flags_g, CLOSE_CONNECTION_FLAG)) {
               on_successfully_receive_general_actions(CLOSE_CONNECTION_FLAG);
            }
            if (read_flag(&successfully_received_flags_g, GET_SERVER_AVAILABILITY_REQUEST_FLAG)) {
               on_successfully_receive_general_actions(GET_SERVER_AVAILABILITY_REQUEST_FLAG);

               if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE) ||
                     is_usart_response_contains_element(ESP8226_RESPONSE_HTTP_STATUS_200_OK)) {

                  if (is_usart_response_contains_element(SERVER_STATUS_INCLUDE_DEBUG_INFO)) {
                     set_flag(&general_flags_g, SEND_DEBUG_INFO_FLAG);
                  } else {
                     reset_flag(&general_flags_g, SEND_DEBUG_INFO_FLAG);
                  }

                  // Reset counter to send the next request in the time interval starting from the received time
                  checking_connection_status_and_server_availability_timer_g = TIMER14_30S;
                  set_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
               } else {
                  reset_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
               }
            }
            if (read_flag(&successfully_received_flags_g, SEND_ALARM_REQUEST_FLAG)) {
               on_successfully_receive_general_actions(SEND_ALARM_REQUEST_FLAG);

               if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE) ||
                     is_usart_response_contains_element(ESP8226_RESPONSE_HTTP_STATUS_200_OK)) {
                  set_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
               } else {
                  reset_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
               }

            }
         }

         unsigned int current_piped_task_to_send = get_current_piped_task_to_send();
         execute_function_for_current_piped_task(current_piped_task_to_send, send_usart_data_passed_time_sec);

         check_connection_status_and_server_availability(&checking_connection_status_and_server_availability_timer_g);

         // LED blinking
         if (!read_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG) && network_searching_status_led_counter_g >= TIMER3_100MS) {
            network_searching_status_led_counter_g = 0;

            if (GPIO_ReadOutputDataBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            } else {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
         }

         if (read_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
         } else {
            reset_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG);
         }
         /*if (read_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG)) {
            GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
         } else {
            GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
         }*/

         if ((send_usart_data_errors_counter_g >= 5 || is_piped_tasks_scheduler_full()) &&
               read_flag(&general_flags_g, SERVER_IS_AVAILABLE_FLAG)) {
            reset_device_state();
         }
         if (resets_occured_g >= 10) {
            NVIC_SystemReset();
         }

         if (is_immobilizer_relay_status_ready_to_be_read()) {
            if (GPIO_ReadInputDataBit(IMMOBILIZER_RELAY_PORT, IMMOBILIZER_RELAY_PIN)) {
               set_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_FLAG);
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
            } else {
               GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
            }
            reset_immobilizer_relay_status();
         }

