hammer-dp-ua/WiFiMotionDetector_with_Immobilizer-STM32/app/main.c
         if (read_flag(&general_flags_g, ALARM_FLAG) && is_piped_tasks_scheduler_empty()) {
            add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
            reset_flag(&general_flags_g, ALARM_FLAG);
         }

         beep(&beeper_counter, read_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_FLAG), reset_immobilizer_activation_flag,
               read_flag(&general_flags_g, IMMOBILIZER_ACTIVATED_SERVER_RECEIVED_FLAG), reset_immobilizer_activated_server_received_flag);
      } else if (esp8266_disabled_counter_g >= TIMER14_1S) {
         esp8266_disabled_counter_g = 0;
         enable_esp8266();
         enable_immobilizer();
      }

      IWDG_ReloadCounter();
   }
}

void reset_device_state() {
   unsigned char is_alarm_occured = is_piped_task_to_send_scheduled(SEND_ALARM_FLAG);

   resets_occured_g++;
   delete_all_piped_tasks();
   clear_piped_request_commands_to_send();
   clear_usart_data_received_buffer();
   on_response_g = NULL;
   send_usart_data_function_g = NULL;

   if (received_usart_error_data_g != NULL) {
      free(received_usart_error_data_g);
      received_usart_error_data_g = NULL;
   }

   general_flags_g = 0;
   successfully_received_flags_g = 0;
   sent_flag_g = 0;
   send_usart_data_errors_counter_g = 0;

   GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);

   add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
   add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   if (is_alarm_occured) {
      add_piped_task_to_send_into_tail(SEND_ALARM_FLAG);
   }
}

void beep(unsigned char *beeper_counter, unsigned char activate_beeper, void (*on_beeper_activation)(), unsigned char server_received_ack, void (*on_server_received)()) {
   if (activate_beeper && !beeper_inactive_timer_g) {
      beeper_inactive_timer_g = TIMER14_60S;
      *beeper_counter = 1;
      set_flag(&general_flags_g, BEEPER_ACTIVATED_FLAG);
      on_beeper_activation();
   }

   if (read_flag(&general_flags_g, BEEPER_ACTIVATED_FLAG) && *beeper_counter && !beeper_interval_timer_g) {
      beeper_interval_timer_g = TIMER14_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter++;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter++;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter++;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_interval_timer_g = 0;
            beeper_alarm_prior_to_response_period_timer_g = TIMER14_500MS;
            reset_flag(&general_flags_g, BEEPER_ACTIVATED_FLAG);
            break;
      }
   }

   if (server_received_ack && !read_flag(&general_flags_g, BEEPER_ACTIVATED_FLAG) && !beeper_inactive_timer_g) {
      on_server_received();
      *beeper_counter = 1;
      set_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG);
   }

   if (read_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG) &&
         !beeper_alarm_prior_to_response_period_timer_g && *beeper_counter && !beeper_interval_timer_g) {
      beeper_interval_timer_g = TIMER14_200MS;

      switch (*beeper_counter) {
         case 1:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 2:
            turn_beeper_off();
            *beeper_counter = *beeper_counter + 1;
            break;
         case 3:
            turn_beeper_on();
            *beeper_counter = *beeper_counter + 1;
            break;
         default:
            turn_beeper_off();
            *beeper_counter = 0;
            beeper_interval_timer_g = 0;
            reset_flag(&general_flags_g, BEEPER_SERVER_RECEIVED_ACK_FLAG);
            break;
      }
   }
}

void check_connection_status_and_server_availability(unsigned short *counter) {
   if (*counter == 0 && is_piped_tasks_scheduler_empty()) {
      *counter = TIMER14_30S;
      add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_FLAG);
      add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   }
}

void execute_function_for_current_piped_task(unsigned int current_piped_task_to_send, unsigned char send_usart_data_passed_time_sec) {
   if (send_usart_data_function_g == NULL && current_piped_task_to_send) {
      if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
         execute_usart_data_sending(disable_echo, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_CONNECTION_STATUS_AND_CONNECT_FLAG ||
            current_piped_task_to_send == GET_CONNECTION_STATUS_FLAG) {
         execute_usart_data_sending(get_connection_status, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
         execute_usart_data_sending(connect_to_network, 10, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
         execute_usart_data_sending(connect_to_server, 10, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG) {
         execute_usart_data_sending(set_bytes_amount_to_send, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG) {
         final_task_for_request_resending_g = GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 5, DO_NOT_EXECUTE_FUNCTION);
         send_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
      } else if (current_piped_task_to_send == GET_CURRENT_DEFAULT_WIFI_MODE_FLAG) {
         execute_usart_data_sending(get_current_default_wifi_mode, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == SET_DEFAULT_STATION_WIFI_MODE_FLAG) {
         execute_usart_data_sending(set_default_wifi_mode, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(get_own_ip_address, 5, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == SET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(set_own_ip_address, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CLOSE_CONNECTION_FLAG) {
         execute_usart_data_sending(close_connection, 20, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_FLAG) {
         // Request 1 part. Preparation
         delete_piped_task(GET_SERVER_AVAILABILITY_FLAG);
         get_server_avalability(GET_SERVER_AVAILABILITY_REQUEST_FLAG);
      } else if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_REQUEST_FLAG) {
         // Request 2 part. Sending
         final_task_for_request_resending_g = GET_SERVER_AVAILABILITY_REQUEST_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 10, DO_NOT_EXECUTE_FUNCTION);

         send_request(GET_SERVER_AVAILABILITY_REQUEST_FLAG);
      } else if (current_piped_task_to_send == SEND_ALARM_FLAG) {
         // Request 1 part. Preparation
         delete_piped_task(SEND_ALARM_FLAG);
         send_alarm(SEND_ALARM_REQUEST_FLAG);
      } else if (current_piped_task_to_send == SEND_ALARM_REQUEST_FLAG) {
         // Request 2 part. Sending
         final_task_for_request_resending_g = SEND_ALARM_REQUEST_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 10, DO_NOT_EXECUTE_FUNCTION);

